ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L4xx/stm32l4a6xx.h
/******************  Bit definition for SYSCFG_SWPR register  ****************/
#define SYSCFG_SWPR_PAGE0_Pos           (0U)
#define SYSCFG_SWPR_PAGE0_Msk           (0x1UL << SYSCFG_SWPR_PAGE0_Pos)       /*!< 0x00000001 */
#define SYSCFG_SWPR_PAGE0               SYSCFG_SWPR_PAGE0_Msk                  /*!< SRAM2 Write protection page 0 */
#define SYSCFG_SWPR_PAGE1_Pos           (1U)
#define SYSCFG_SWPR_PAGE1_Msk           (0x1UL << SYSCFG_SWPR_PAGE1_Pos)       /*!< 0x00000002 */
#define SYSCFG_SWPR_PAGE1               SYSCFG_SWPR_PAGE1_Msk                  /*!< SRAM2 Write protection page 1 */
#define SYSCFG_SWPR_PAGE2_Pos           (2U)
#define SYSCFG_SWPR_PAGE2_Msk           (0x1UL << SYSCFG_SWPR_PAGE2_Pos)       /*!< 0x00000004 */
#define SYSCFG_SWPR_PAGE2               SYSCFG_SWPR_PAGE2_Msk                  /*!< SRAM2 Write protection page 2 */
#define SYSCFG_SWPR_PAGE3_Pos           (3U)
#define SYSCFG_SWPR_PAGE3_Msk           (0x1UL << SYSCFG_SWPR_PAGE3_Pos)       /*!< 0x00000008 */
#define SYSCFG_SWPR_PAGE3               SYSCFG_SWPR_PAGE3_Msk                  /*!< SRAM2 Write protection page 3 */
#define SYSCFG_SWPR_PAGE4_Pos           (4U)
#define SYSCFG_SWPR_PAGE4_Msk           (0x1UL << SYSCFG_SWPR_PAGE4_Pos)       /*!< 0x00000010 */
#define SYSCFG_SWPR_PAGE4               SYSCFG_SWPR_PAGE4_Msk                  /*!< SRAM2 Write protection page 4 */
#define SYSCFG_SWPR_PAGE5_Pos           (5U)
#define SYSCFG_SWPR_PAGE5_Msk           (0x1UL << SYSCFG_SWPR_PAGE5_Pos)       /*!< 0x00000020 */
#define SYSCFG_SWPR_PAGE5               SYSCFG_SWPR_PAGE5_Msk                  /*!< SRAM2 Write protection page 5 */
#define SYSCFG_SWPR_PAGE6_Pos           (6U)
#define SYSCFG_SWPR_PAGE6_Msk           (0x1UL << SYSCFG_SWPR_PAGE6_Pos)       /*!< 0x00000040 */
#define SYSCFG_SWPR_PAGE6               SYSCFG_SWPR_PAGE6_Msk                  /*!< SRAM2 Write protection page 6 */
#define SYSCFG_SWPR_PAGE7_Pos           (7U)
#define SYSCFG_SWPR_PAGE7_Msk           (0x1UL << SYSCFG_SWPR_PAGE7_Pos)       /*!< 0x00000080 */
#define SYSCFG_SWPR_PAGE7               SYSCFG_SWPR_PAGE7_Msk                  /*!< SRAM2 Write protection page 7 */
#define SYSCFG_SWPR_PAGE8_Pos           (8U)
#define SYSCFG_SWPR_PAGE8_Msk           (0x1UL << SYSCFG_SWPR_PAGE8_Pos)       /*!< 0x00000100 */
#define SYSCFG_SWPR_PAGE8               SYSCFG_SWPR_PAGE8_Msk                  /*!< SRAM2 Write protection page 8 */
#define SYSCFG_SWPR_PAGE9_Pos           (9U)
#define SYSCFG_SWPR_PAGE9_Msk           (0x1UL << SYSCFG_SWPR_PAGE9_Pos)       /*!< 0x00000200 */
#define SYSCFG_SWPR_PAGE9               SYSCFG_SWPR_PAGE9_Msk                  /*!< SRAM2 Write protection page 9 */
#define SYSCFG_SWPR_PAGE10_Pos          (10U)
#define SYSCFG_SWPR_PAGE10_Msk          (0x1UL << SYSCFG_SWPR_PAGE10_Pos)      /*!< 0x00000400 */
#define SYSCFG_SWPR_PAGE10              SYSCFG_SWPR_PAGE10_Msk                 /*!< SRAM2 Write protection page 10*/
#define SYSCFG_SWPR_PAGE11_Pos          (11U)
#define SYSCFG_SWPR_PAGE11_Msk          (0x1UL << SYSCFG_SWPR_PAGE11_Pos)      /*!< 0x00000800 */
#define SYSCFG_SWPR_PAGE11              SYSCFG_SWPR_PAGE11_Msk                 /*!< SRAM2 Write protection page 11*/
#define SYSCFG_SWPR_PAGE12_Pos          (12U)
#define SYSCFG_SWPR_PAGE12_Msk          (0x1UL << SYSCFG_SWPR_PAGE12_Pos)      /*!< 0x00001000 */
#define SYSCFG_SWPR_PAGE12              SYSCFG_SWPR_PAGE12_Msk                 /*!< SRAM2 Write protection page 12*/
#define SYSCFG_SWPR_PAGE13_Pos          (13U)
#define SYSCFG_SWPR_PAGE13_Msk          (0x1UL << SYSCFG_SWPR_PAGE13_Pos)      /*!< 0x00002000 */
#define SYSCFG_SWPR_PAGE13              SYSCFG_SWPR_PAGE13_Msk                 /*!< SRAM2 Write protection page 13*/
#define SYSCFG_SWPR_PAGE14_Pos          (14U)
#define SYSCFG_SWPR_PAGE14_Msk          (0x1UL << SYSCFG_SWPR_PAGE14_Pos)      /*!< 0x00004000 */
#define SYSCFG_SWPR_PAGE14              SYSCFG_SWPR_PAGE14_Msk                 /*!< SRAM2 Write protection page 14*/
#define SYSCFG_SWPR_PAGE15_Pos          (15U)
#define SYSCFG_SWPR_PAGE15_Msk          (0x1UL << SYSCFG_SWPR_PAGE15_Pos)      /*!< 0x00008000 */
#define SYSCFG_SWPR_PAGE15              SYSCFG_SWPR_PAGE15_Msk                 /*!< SRAM2 Write protection page 15*/
#define SYSCFG_SWPR_PAGE16_Pos          (16U)
#define SYSCFG_SWPR_PAGE16_Msk          (0x1UL << SYSCFG_SWPR_PAGE16_Pos)      /*!< 0x00010000 */
#define SYSCFG_SWPR_PAGE16              SYSCFG_SWPR_PAGE16_Msk                 /*!< SRAM2 Write protection page 16*/
#define SYSCFG_SWPR_PAGE17_Pos          (17U)
#define SYSCFG_SWPR_PAGE17_Msk          (0x1UL << SYSCFG_SWPR_PAGE17_Pos)      /*!< 0x00020000 */
#define SYSCFG_SWPR_PAGE17              SYSCFG_SWPR_PAGE17_Msk                 /*!< SRAM2 Write protection page 17*/
#define SYSCFG_SWPR_PAGE18_Pos          (18U)
#define SYSCFG_SWPR_PAGE18_Msk          (0x1UL << SYSCFG_SWPR_PAGE18_Pos)      /*!< 0x00040000 */
#define SYSCFG_SWPR_PAGE18              SYSCFG_SWPR_PAGE18_Msk                 /*!< SRAM2 Write protection page 18*/
#define SYSCFG_SWPR_PAGE19_Pos          (19U)
#define SYSCFG_SWPR_PAGE19_Msk          (0x1UL << SYSCFG_SWPR_PAGE19_Pos)      /*!< 0x00080000 */
#define SYSCFG_SWPR_PAGE19              SYSCFG_SWPR_PAGE19_Msk                 /*!< SRAM2 Write protection page 19*/
#define SYSCFG_SWPR_PAGE20_Pos          (20U)
#define SYSCFG_SWPR_PAGE20_Msk          (0x1UL << SYSCFG_SWPR_PAGE20_Pos)      /*!< 0x00100000 */
#define SYSCFG_SWPR_PAGE20              SYSCFG_SWPR_PAGE20_Msk                 /*!< SRAM2 Write protection page 20*/
#define SYSCFG_SWPR_PAGE21_Pos          (21U)
#define SYSCFG_SWPR_PAGE21_Msk          (0x1UL << SYSCFG_SWPR_PAGE21_Pos)      /*!< 0x00200000 */
#define SYSCFG_SWPR_PAGE21              SYSCFG_SWPR_PAGE21_Msk                 /*!< SRAM2 Write protection page 21*/
#define SYSCFG_SWPR_PAGE22_Pos          (22U)
#define SYSCFG_SWPR_PAGE22_Msk          (0x1UL << SYSCFG_SWPR_PAGE22_Pos)      /*!< 0x00400000 */
#define SYSCFG_SWPR_PAGE22              SYSCFG_SWPR_PAGE22_Msk                 /*!< SRAM2 Write protection page 22*/
#define SYSCFG_SWPR_PAGE23_Pos          (23U)
#define SYSCFG_SWPR_PAGE23_Msk          (0x1UL << SYSCFG_SWPR_PAGE23_Pos)      /*!< 0x00800000 */
#define SYSCFG_SWPR_PAGE23              SYSCFG_SWPR_PAGE23_Msk                 /*!< SRAM2 Write protection page 23*/
#define SYSCFG_SWPR_PAGE24_Pos          (24U)
#define SYSCFG_SWPR_PAGE24_Msk          (0x1UL << SYSCFG_SWPR_PAGE24_Pos)      /*!< 0x01000000 */
#define SYSCFG_SWPR_PAGE24              SYSCFG_SWPR_PAGE24_Msk                 /*!< SRAM2 Write protection page 24*/
#define SYSCFG_SWPR_PAGE25_Pos          (25U)
#define SYSCFG_SWPR_PAGE25_Msk          (0x1UL << SYSCFG_SWPR_PAGE25_Pos)      /*!< 0x02000000 */
#define SYSCFG_SWPR_PAGE25              SYSCFG_SWPR_PAGE25_Msk                 /*!< SRAM2 Write protection page 25*/
#define SYSCFG_SWPR_PAGE26_Pos          (26U)
#define SYSCFG_SWPR_PAGE26_Msk          (0x1UL << SYSCFG_SWPR_PAGE26_Pos)      /*!< 0x04000000 */
#define SYSCFG_SWPR_PAGE26              SYSCFG_SWPR_PAGE26_Msk                 /*!< SRAM2 Write protection page 26*/
#define SYSCFG_SWPR_PAGE27_Pos          (27U)
#define SYSCFG_SWPR_PAGE27_Msk          (0x1UL << SYSCFG_SWPR_PAGE27_Pos)      /*!< 0x08000000 */
#define SYSCFG_SWPR_PAGE27              SYSCFG_SWPR_PAGE27_Msk                 /*!< SRAM2 Write protection page 27*/
#define SYSCFG_SWPR_PAGE28_Pos          (28U)
#define SYSCFG_SWPR_PAGE28_Msk          (0x1UL << SYSCFG_SWPR_PAGE28_Pos)      /*!< 0x10000000 */
#define SYSCFG_SWPR_PAGE28              SYSCFG_SWPR_PAGE28_Msk                 /*!< SRAM2 Write protection page 28*/
#define SYSCFG_SWPR_PAGE29_Pos          (29U)
#define SYSCFG_SWPR_PAGE29_Msk          (0x1UL << SYSCFG_SWPR_PAGE29_Pos)      /*!< 0x20000000 */
#define SYSCFG_SWPR_PAGE29              SYSCFG_SWPR_PAGE29_Msk                 /*!< SRAM2 Write protection page 29*/
#define SYSCFG_SWPR_PAGE30_Pos          (30U)
#define SYSCFG_SWPR_PAGE30_Msk          (0x1UL << SYSCFG_SWPR_PAGE30_Pos)      /*!< 0x40000000 */
#define SYSCFG_SWPR_PAGE30              SYSCFG_SWPR_PAGE30_Msk                 /*!< SRAM2 Write protection page 30*/
#define SYSCFG_SWPR_PAGE31_Pos          (31U)
#define SYSCFG_SWPR_PAGE31_Msk          (0x1UL << SYSCFG_SWPR_PAGE31_Pos)      /*!< 0x80000000 */
#define SYSCFG_SWPR_PAGE31              SYSCFG_SWPR_PAGE31_Msk                 /*!< SRAM2 Write protection page 31*/

/******************  Bit definition for SYSCFG_SWPR2 register  ***************/
#define SYSCFG_SWPR2_PAGE32_Pos         (0U)
#define SYSCFG_SWPR2_PAGE32_Msk         (0x1UL << SYSCFG_SWPR2_PAGE32_Pos)     /*!< 0x00000001 */
#define SYSCFG_SWPR2_PAGE32             SYSCFG_SWPR2_PAGE32_Msk                /*!< SRAM2 Write protection page 32*/
#define SYSCFG_SWPR2_PAGE33_Pos         (1U)
#define SYSCFG_SWPR2_PAGE33_Msk         (0x1UL << SYSCFG_SWPR2_PAGE33_Pos)     /*!< 0x00000002 */
#define SYSCFG_SWPR2_PAGE33             SYSCFG_SWPR2_PAGE33_Msk                /*!< SRAM2 Write protection page 33*/
#define SYSCFG_SWPR2_PAGE34_Pos         (2U)
#define SYSCFG_SWPR2_PAGE34_Msk         (0x1UL << SYSCFG_SWPR2_PAGE34_Pos)     /*!< 0x00000004 */
#define SYSCFG_SWPR2_PAGE34             SYSCFG_SWPR2_PAGE34_Msk                /*!< SRAM2 Write protection page 34*/
#define SYSCFG_SWPR2_PAGE35_Pos         (3U)
#define SYSCFG_SWPR2_PAGE35_Msk         (0x1UL << SYSCFG_SWPR2_PAGE35_Pos)     /*!< 0x00000008 */
#define SYSCFG_SWPR2_PAGE35             SYSCFG_SWPR2_PAGE35_Msk                /*!< SRAM2 Write protection page 35*/
#define SYSCFG_SWPR2_PAGE36_Pos         (4U)
#define SYSCFG_SWPR2_PAGE36_Msk         (0x1UL << SYSCFG_SWPR2_PAGE36_Pos)     /*!< 0x00000010 */
#define SYSCFG_SWPR2_PAGE36             SYSCFG_SWPR2_PAGE36_Msk                /*!< SRAM2 Write protection page 36*/
#define SYSCFG_SWPR2_PAGE37_Pos         (5U)
#define SYSCFG_SWPR2_PAGE37_Msk         (0x1UL << SYSCFG_SWPR2_PAGE37_Pos)     /*!< 0x00000020 */
#define SYSCFG_SWPR2_PAGE37             SYSCFG_SWPR2_PAGE37_Msk                /*!< SRAM2 Write protection page 37*/
#define SYSCFG_SWPR2_PAGE38_Pos         (6U)
#define SYSCFG_SWPR2_PAGE38_Msk         (0x1UL << SYSCFG_SWPR2_PAGE38_Pos)     /*!< 0x00000040 */
#define SYSCFG_SWPR2_PAGE38             SYSCFG_SWPR2_PAGE38_Msk                /*!< SRAM2 Write protection page 38*/
#define SYSCFG_SWPR2_PAGE39_Pos         (7U)
#define SYSCFG_SWPR2_PAGE39_Msk         (0x1UL << SYSCFG_SWPR2_PAGE39_Pos)     /*!< 0x00000080 */
#define SYSCFG_SWPR2_PAGE39             SYSCFG_SWPR2_PAGE39_Msk                /*!< SRAM2 Write protection page 39*/
#define SYSCFG_SWPR2_PAGE40_Pos         (8U)
#define SYSCFG_SWPR2_PAGE40_Msk         (0x1UL << SYSCFG_SWPR2_PAGE40_Pos)     /*!< 0x00000100 */
#define SYSCFG_SWPR2_PAGE40             SYSCFG_SWPR2_PAGE40_Msk                /*!< SRAM2 Write protection page 40*/
#define SYSCFG_SWPR2_PAGE41_Pos         (9U)
#define SYSCFG_SWPR2_PAGE41_Msk         (0x1UL << SYSCFG_SWPR2_PAGE41_Pos)     /*!< 0x00000200 */
#define SYSCFG_SWPR2_PAGE41             SYSCFG_SWPR2_PAGE41_Msk                /*!< SRAM2 Write protection page 41*/
#define SYSCFG_SWPR2_PAGE42_Pos         (10U)
#define SYSCFG_SWPR2_PAGE42_Msk         (0x1UL << SYSCFG_SWPR2_PAGE42_Pos)     /*!< 0x00000400 */
#define SYSCFG_SWPR2_PAGE42             SYSCFG_SWPR2_PAGE42_Msk                /*!< SRAM2 Write protection page 42*/
#define SYSCFG_SWPR2_PAGE43_Pos         (11U)
#define SYSCFG_SWPR2_PAGE43_Msk         (0x1UL << SYSCFG_SWPR2_PAGE43_Pos)     /*!< 0x00000800 */
#define SYSCFG_SWPR2_PAGE43             SYSCFG_SWPR2_PAGE43_Msk                /*!< SRAM2 Write protection page 43*/
#define SYSCFG_SWPR2_PAGE44_Pos         (12U)
#define SYSCFG_SWPR2_PAGE44_Msk         (0x1UL << SYSCFG_SWPR2_PAGE44_Pos)     /*!< 0x00001000 */
#define SYSCFG_SWPR2_PAGE44             SYSCFG_SWPR2_PAGE44_Msk                /*!< SRAM2 Write protection page 44*/
#define SYSCFG_SWPR2_PAGE45_Pos         (13U)
#define SYSCFG_SWPR2_PAGE45_Msk         (0x1UL << SYSCFG_SWPR2_PAGE45_Pos)     /*!< 0x00002000 */
#define SYSCFG_SWPR2_PAGE45             SYSCFG_SWPR2_PAGE45_Msk                /*!< SRAM2 Write protection page 45*/
#define SYSCFG_SWPR2_PAGE46_Pos         (14U)
#define SYSCFG_SWPR2_PAGE46_Msk         (0x1UL << SYSCFG_SWPR2_PAGE46_Pos)     /*!< 0x00004000 */
#define SYSCFG_SWPR2_PAGE46             SYSCFG_SWPR2_PAGE46_Msk                /*!< SRAM2 Write protection page 46*/
#define SYSCFG_SWPR2_PAGE47_Pos         (15U)
#define SYSCFG_SWPR2_PAGE47_Msk         (0x1UL << SYSCFG_SWPR2_PAGE47_Pos)     /*!< 0x00008000 */
#define SYSCFG_SWPR2_PAGE47             SYSCFG_SWPR2_PAGE47_Msk                /*!< SRAM2 Write protection page 47*/
#define SYSCFG_SWPR2_PAGE48_Pos         (16U)
#define SYSCFG_SWPR2_PAGE48_Msk         (0x1UL << SYSCFG_SWPR2_PAGE48_Pos)     /*!< 0x00010000 */
#define SYSCFG_SWPR2_PAGE48             SYSCFG_SWPR2_PAGE48_Msk                /*!< SRAM2 Write protection page 48*/
#define SYSCFG_SWPR2_PAGE49_Pos         (17U)
#define SYSCFG_SWPR2_PAGE49_Msk         (0x1UL << SYSCFG_SWPR2_PAGE49_Pos)     /*!< 0x00020000 */
#define SYSCFG_SWPR2_PAGE49             SYSCFG_SWPR2_PAGE49_Msk                /*!< SRAM2 Write protection page 49*/
#define SYSCFG_SWPR2_PAGE50_Pos         (18U)
#define SYSCFG_SWPR2_PAGE50_Msk         (0x1UL << SYSCFG_SWPR2_PAGE50_Pos)     /*!< 0x00040000 */
#define SYSCFG_SWPR2_PAGE50             SYSCFG_SWPR2_PAGE50_Msk                /*!< SRAM2 Write protection page 50*/
#define SYSCFG_SWPR2_PAGE51_Pos         (19U)
#define SYSCFG_SWPR2_PAGE51_Msk         (0x1UL << SYSCFG_SWPR2_PAGE51_Pos)     /*!< 0x00080000 */
#define SYSCFG_SWPR2_PAGE51             SYSCFG_SWPR2_PAGE51_Msk                /*!< SRAM2 Write protection page 51*/
#define SYSCFG_SWPR2_PAGE52_Pos         (20U)
#define SYSCFG_SWPR2_PAGE52_Msk         (0x1UL << SYSCFG_SWPR2_PAGE52_Pos)     /*!< 0x00100000 */
#define SYSCFG_SWPR2_PAGE52             SYSCFG_SWPR2_PAGE52_Msk                /*!< SRAM2 Write protection page 52*/
#define SYSCFG_SWPR2_PAGE53_Pos         (21U)
#define SYSCFG_SWPR2_PAGE53_Msk         (0x1UL << SYSCFG_SWPR2_PAGE53_Pos)     /*!< 0x00200000 */
#define SYSCFG_SWPR2_PAGE53             SYSCFG_SWPR2_PAGE53_Msk                /*!< SRAM2 Write protection page 53*/
#define SYSCFG_SWPR2_PAGE54_Pos         (22U)
#define SYSCFG_SWPR2_PAGE54_Msk         (0x1UL << SYSCFG_SWPR2_PAGE54_Pos)     /*!< 0x00400000 */
#define SYSCFG_SWPR2_PAGE54             SYSCFG_SWPR2_PAGE54_Msk                /*!< SRAM2 Write protection page 54*/
#define SYSCFG_SWPR2_PAGE55_Pos         (23U)
#define SYSCFG_SWPR2_PAGE55_Msk         (0x1UL << SYSCFG_SWPR2_PAGE55_Pos)     /*!< 0x00800000 */
#define SYSCFG_SWPR2_PAGE55             SYSCFG_SWPR2_PAGE55_Msk                /*!< SRAM2 Write protection page 55*/
#define SYSCFG_SWPR2_PAGE56_Pos         (24U)
#define SYSCFG_SWPR2_PAGE56_Msk         (0x1UL << SYSCFG_SWPR2_PAGE56_Pos)     /*!< 0x01000000 */
#define SYSCFG_SWPR2_PAGE56             SYSCFG_SWPR2_PAGE56_Msk                /*!< SRAM2 Write protection page 56*/
#define SYSCFG_SWPR2_PAGE57_Pos         (25U)
#define SYSCFG_SWPR2_PAGE57_Msk         (0x1UL << SYSCFG_SWPR2_PAGE57_Pos)     /*!< 0x02000000 */
#define SYSCFG_SWPR2_PAGE57             SYSCFG_SWPR2_PAGE57_Msk                /*!< SRAM2 Write protection page 57*/
#define SYSCFG_SWPR2_PAGE58_Pos         (26U)
#define SYSCFG_SWPR2_PAGE58_Msk         (0x1UL << SYSCFG_SWPR2_PAGE58_Pos)     /*!< 0x04000000 */
#define SYSCFG_SWPR2_PAGE58             SYSCFG_SWPR2_PAGE58_Msk                /*!< SRAM2 Write protection page 58*/
#define SYSCFG_SWPR2_PAGE59_Pos         (27U)
#define SYSCFG_SWPR2_PAGE59_Msk         (0x1UL << SYSCFG_SWPR2_PAGE59_Pos)     /*!< 0x08000000 */
#define SYSCFG_SWPR2_PAGE59             SYSCFG_SWPR2_PAGE59_Msk                /*!< SRAM2 Write protection page 59*/
#define SYSCFG_SWPR2_PAGE60_Pos         (28U)
#define SYSCFG_SWPR2_PAGE60_Msk         (0x1UL << SYSCFG_SWPR2_PAGE60_Pos)     /*!< 0x10000000 */
#define SYSCFG_SWPR2_PAGE60             SYSCFG_SWPR2_PAGE60_Msk                /*!< SRAM2 Write protection page 60*/
#define SYSCFG_SWPR2_PAGE61_Pos         (29U)
#define SYSCFG_SWPR2_PAGE61_Msk         (0x1UL << SYSCFG_SWPR2_PAGE61_Pos)     /*!< 0x20000000 */
#define SYSCFG_SWPR2_PAGE61             SYSCFG_SWPR2_PAGE61_Msk                /*!< SRAM2 Write protection page 61*/
#define SYSCFG_SWPR2_PAGE62_Pos         (30U)
#define SYSCFG_SWPR2_PAGE62_Msk         (0x1UL << SYSCFG_SWPR2_PAGE62_Pos)     /*!< 0x40000000 */
#define SYSCFG_SWPR2_PAGE62             SYSCFG_SWPR2_PAGE62_Msk                /*!< SRAM2 Write protection page 62*/
#define SYSCFG_SWPR2_PAGE63_Pos         (31U)
#define SYSCFG_SWPR2_PAGE63_Msk         (0x1UL << SYSCFG_SWPR2_PAGE63_Pos)     /*!< 0x80000000 */
#define SYSCFG_SWPR2_PAGE63             SYSCFG_SWPR2_PAGE63_Msk                /*!< SRAM2 Write protection page 63*/

/******************  Bit definition for SYSCFG_SKR register  ****************/
#define SYSCFG_SKR_KEY_Pos              (0U)
#define SYSCFG_SKR_KEY_Msk              (0xFFUL << SYSCFG_SKR_KEY_Pos)         /*!< 0x000000FF */
#define SYSCFG_SKR_KEY                  SYSCFG_SKR_KEY_Msk                     /*!<  SRAM2 write protection key for software erase  */




/******************************************************************************/
/*                                                                            */
/*                                    TIM                                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for TIM_CR1 register  ********************/
#define TIM_CR1_CEN_Pos           (0U)
#define TIM_CR1_CEN_Msk           (0x1UL << TIM_CR1_CEN_Pos)                   /*!< 0x00000001 */
#define TIM_CR1_CEN               TIM_CR1_CEN_Msk                              /*!<Counter enable */
#define TIM_CR1_UDIS_Pos          (1U)
#define TIM_CR1_UDIS_Msk          (0x1UL << TIM_CR1_UDIS_Pos)                  /*!< 0x00000002 */
#define TIM_CR1_UDIS              TIM_CR1_UDIS_Msk                             /*!<Update disable */
#define TIM_CR1_URS_Pos           (2U)
#define TIM_CR1_URS_Msk           (0x1UL << TIM_CR1_URS_Pos)                   /*!< 0x00000004 */
#define TIM_CR1_URS               TIM_CR1_URS_Msk                              /*!<Update request source */
#define TIM_CR1_OPM_Pos           (3U)
#define TIM_CR1_OPM_Msk           (0x1UL << TIM_CR1_OPM_Pos)                   /*!< 0x00000008 */
#define TIM_CR1_OPM               TIM_CR1_OPM_Msk                              /*!<One pulse mode */
#define TIM_CR1_DIR_Pos           (4U)
#define TIM_CR1_DIR_Msk           (0x1UL << TIM_CR1_DIR_Pos)                   /*!< 0x00000010 */
#define TIM_CR1_DIR               TIM_CR1_DIR_Msk                              /*!<Direction */

#define TIM_CR1_CMS_Pos           (5U)
#define TIM_CR1_CMS_Msk           (0x3UL << TIM_CR1_CMS_Pos)                   /*!< 0x00000060 */
#define TIM_CR1_CMS               TIM_CR1_CMS_Msk                              /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CR1_CMS_0             (0x1UL << TIM_CR1_CMS_Pos)                   /*!< 0x00000020 */
#define TIM_CR1_CMS_1             (0x2UL << TIM_CR1_CMS_Pos)                   /*!< 0x00000040 */

#define TIM_CR1_ARPE_Pos          (7U)
#define TIM_CR1_ARPE_Msk          (0x1UL << TIM_CR1_ARPE_Pos)                  /*!< 0x00000080 */
#define TIM_CR1_ARPE              TIM_CR1_ARPE_Msk                             /*!<Auto-reload preload enable */

#define TIM_CR1_CKD_Pos           (8U)
#define TIM_CR1_CKD_Msk           (0x3UL << TIM_CR1_CKD_Pos)                   /*!< 0x00000300 */
#define TIM_CR1_CKD               TIM_CR1_CKD_Msk                              /*!<CKD[1:0] bits (clock division) */
#define TIM_CR1_CKD_0             (0x1UL << TIM_CR1_CKD_Pos)                   /*!< 0x00000100 */
#define TIM_CR1_CKD_1             (0x2UL << TIM_CR1_CKD_Pos)                   /*!< 0x00000200 */

#define TIM_CR1_UIFREMAP_Pos      (11U)
#define TIM_CR1_UIFREMAP_Msk      (0x1UL << TIM_CR1_UIFREMAP_Pos)              /*!< 0x00000800 */
#define TIM_CR1_UIFREMAP          TIM_CR1_UIFREMAP_Msk                         /*!<Update interrupt flag remap */

